//
// Config.h
// Конфигурация устройства
//


#ifndef CONFIG_H_
#define CONFIG_H_

	// =============================================================================================
	// Параметры обновления ПО
	// =============================================================================================
	// Точка доступа
	#define WIFI_AP_SSID     "Piranha"
	#define WIFI_AP_PASSWORD "oceanika"
	// Сеть, куда подключаемся
	#define WIFI_SSID        "FilF"
	#define WIFI_PASSWORD    "murmansk13"
	
	// =============================================================================================
	// HC-12
	// =============================================================================================

	// Максимальный номер канала HC-12
	#define MAX_CHANNEL      12

	// =============================================================================================
	// Веб
	// =============================================================================================
	#define WEB_AVAILABLE    0
  
	// =============================================================================================
	// Параметры ESC-драйвера управления моторами
	// =============================================================================================
	// Отклонение от средней ширины импульса на ESC, мкс
	#define ESC_DISTANCE 490
	// Ширина импульса средней точки ESC (мотор стоит), мкс
	#define ESC_MIDDLE   1490

	// =============================================================================================
	// Параметры джойстика
	// =============================================================================================
	// Сколько единиц отклонения джойстика игнорировать для начала работы
	#define JOYSTICK_SAFE_ZONE 20

	// Шаг открытия руки в градусах на шаг
	#define HAND_STEP          0.5f
	// Минимальное положение руки
	#define HAND_MIN_POS       30
	// Максимальное положение руки
	#define HAND_MAX_POS       120

	// Таймаут на потерю джойстика, мс
	#define JOYSTICK_TIMEOUT   4000

	// =============================================================================================
	// Параметры датчиков
	// =============================================================================================
	// Включён датчик глубины (и есть ПИД на удержание глубины)
	#define ENABLE_PRESSURE                  1
	// Включён магнитометр и вычисление курсового угла (условно)
	#define ENABLE_COMPASS                   0
	// Включен ли датчик навигации
	#define ENABLE_NAVIGATION                1
	// Включена ли отладка по UDP
	#define ENABLE_UDP_DEBUG                 1
	// Моторы всегда включены
	#define ENABLE_MOTOR_ALWAYS_ENABLES      1
	
	// Разрешён датчик цвета
	#define ENABLE_RGB                       1
	// Передатчик по-умолчанию
	// 0 - UART
	// 1 - RS-485
	// 2 - HC-12
	#define TRANSMITTER                      0

	// Порт для отладочных сообщений по умолчанию
	#define DEBUG_UDP_PORT                   19988
	// Период отправки отладочных сообщений по умолчанию
	#define DEBUG_UDP_PERIOD                 100


	// =============================================================================================
	// Параметры управления двигателями (определяется способом и типом устанавливаемых двигателей)
	// =============================================================================================
	// Направления двигателей (1 или -1)
	#define UL_DIR                           1 // Левый двигатель вертикальной ориентации
	#define UR_DIR                           1 // Правый двигатель вертикальной ориентации
	#define HL_DIR                           1 // Левый двигатель горизонтальной ориентации
	#define HR_DIR                          -1 // Правый двигатель горизонтальной ориентации
	
	// Корректировка силы двигателей (float), нормальное 1, больше > 1, меньше < 1
	#define UL_COEFF                         1 // Левый двигатель вертикальной ориентации
	#define UR_COEFF                         1 // Правый двигатель вертикальной ориентации
	#define HL_COEFF                         1 // Левый двигатель горизонтальной ориентации
	#define HR_COEFF                         1 // Правый двигатель горизонтальной ориентации
	
	// =============================================================================================
	// Параметры управления движением робота
	// =============================================================================================
	// Коэффициенты для поворотов (int)
	#define YAW_COEFF                        1 // Насколько менее сильно влияют на моторы повороты при гор. движении
	#define ROLL_COEFF                       2 // Насколько менее сильно влияют на моторы повороты при верт. движении
	
	// Максимальная мощность моторов глубины (0-127)
	#define DEPTH_MAX_POWER                  120

	// Максимальная мощность моторов крена
	#define ROLL_MAX_POWER                   20
	
	// Шаг изменения глубины при макс. отклонениии джойстика (см/128)
	#define DEPTH_CHANGE_COEFF               0.8f

	// Коэффициенты ПИД-регулятора контроля глубины
	#define DEPTH_PID_P                      6
	#define DEPTH_PID_I                      0.06f
	#define DEPTH_PID_D                      0.01f
	
	// Максимальная ошибка угла курса (10-50)
	#define MAX_YAW_ERROR                    20
	
	// Коэффициент на смену курса от джойстика
	#define YAW_CHANGE_COEFF                 15
	
	// Коэффициенты ПИД-регулятора контроля курса
	#define YAW_PID_P                        4
	#define YAW_PID_I                        0.08f
	#define YAW_PID_D                        0.02f
	
	// Коэффициенты ПИД-регулятора контроля крена
	#define ROLL_PID_P                       0.40f
	#define ROLL_PID_I                       0.00f
	#define ROLL_PID_D                       0.00f
	
	// Зона относительно центра джойстика (0-127), в которой работат пид на удержание глубины
	#define UPDOWN_JOYSTICK_NOISE_HISTERESIS  20

	// Коэффициент фильтрации глубины (0-1)
	#define DEPTH_FILTER_ALPHA               0.2f

	// =============================================================================================
	// Параметры работы в режиме программируемого устройства
	// =============================================================================================
	// Время ожидания старта моторов после подачи управляющего сигнала, мс
	#define MOTOR_WAIT_TIME_MS               100
	
#endif /* CONFIG_H_ */
